### Forest: Benchmark Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.benchmark.data.external.sources_tar: Reading...
module.benchmark.data.local_file.init: Reading...
module.benchmark.data.local_file.init: Read complete after 0s [id=ac01021d6b8feecbfdfa37d417c8da525ee65b1a]
module.benchmark.data.external.sources_tar: Read complete after 0s [id=-]
module.benchmark.data.local_file.sources: Reading...
module.benchmark.data.digitalocean_project.forest_project: Reading...
module.benchmark.data.local_file.sources: Read complete after 0s [id=d40f7902a30bc1ddf9e7693830aed53a037bef32]
module.benchmark.data.digitalocean_ssh_keys.keys: Reading...
module.benchmark.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/4003270040538543685]
module.benchmark.digitalocean_droplet.forest: Refreshing state... [id=373132554]
module.benchmark.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.benchmark.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.benchmark.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-09-04T09:46:29Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "373132554" -> (known after apply)
      ~ ipv4_address         = "209.38.204.142" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.7" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-benchmark"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:373132554" -> (known after apply)
      ~ user_data            = "2817bf544ba240cf034e4e0c18759f4f95afdc3b" -> "16ba648e2c1ba954784eac9f729d78967b91374e" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.benchmark.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:373132554",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "209.38.204.142",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>